app/views/topics/index.html.erb

        <!-- <td><%= topic.description %></td> -->
        <td><%= pluralize(topic.votes.size, "vote") %></td>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."topic_id" = ?  [["topic_id", 1]]