app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"  ORDER BY votes_count DESC

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "string", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title "], ["string", "string"], ["description", "description"], ["created_at", "2016-05-25 06:26:31.342489"], ["updated_at", "2016-05-25 06:26:31.342489"]]

  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 1], ["created_at", "2016-05-25 14:59:07.866958"], ["updated_at", "2016-05-25 14:59:07.866958"]]

  def downvote
    @topic = Topic.find(params[:id])
    if @topic.votes.count > 0
       @topic.votes.first.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."topic_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["topic_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."topic_id" = ?  [["topic_id", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]